from time import *
begin = time()
print('-------------------- 欢迎光临《唐僧大战白骨精》 --------------------')
print('请选择你的身份：','\n1.唐僧','\n2.白骨精')
s = str(input('请选择【1—2】：'))
if s == '1' :
    print('------------------------------------------------------------------\n你已经选择了1，你将以->唐僧<-的身份来进行游戏！\n--------------------------------------------------------------\n唐僧，你的生命值是 2 , 你的攻击力是 2\n------------------------------------------------------------------')
elif s == '2' :
    print('------------------------------------------------------------------\n你竟然选择了白骨精，真不要脸，你将以->唐僧<-的身份来进行游戏！\n--------------------------------------------------------------\n唐僧，你的生命值是 2 , 你的攻击力是 2\n------------------------------------------------------------------')
else :
    print('------------------------------------------------------------------\n你输入的有误，系统将自动分配身份，你将以->唐僧<-的身份来进行游戏！\n--------------------------------------------------------------\n唐僧，你的生命值是 2 , 你的攻击力是 2\n------------------------------------------------------------------')
i = 1
a = 2
b = 2
while i < 4 :
    j = str(input('请你选择以下操作：\n  1.练级\n  2.打BOSS\n   3.逃跑\n请选择要做的操作【1—3】：'))

    if j == '3' :
        print('------------------------------------------------------------------\n->唐僧<-一扭头，撒腿就跑！GAME OVER')
        break
    elif j == '1' :
        a += 2
        b += 2
        print('------------------------------------------------------------------\n恭喜你升级了！，你现在的生命值是 ',a ,' 你的攻击力是',b,'\n------------------------------------------------------------------')
    elif j == '2' :
        if a >= 10 and b >=10 :
            print('------------------------------\n->唐僧<- 攻击了 ->白骨精<-\n->白骨精<-受到了 ',a,' 点伤害，重伤不治死了，->唐僧<-赢得了胜利！\n')
            
        else :
           print('->唐僧<- 攻击了 ->白骨精<-\n->白骨精<- 攻击了 ->唐僧<-\n你受到了 10 点伤害，重伤不治死了！GAME OVER\n')
        break
    else :
        print('你输入的有误，请重新输入')
over =time()
print('游戏所用时间：',over-begin)
    
